; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v3)
             (pred_1 ?v7 ?v6)
             (pred_6 ?v9 ?v6)
             (pred_12 ?v11 ?v9 )
	     (pred_11 ?v9)
             (pred_8 ?v12)
             (pred_5 ?v7)
             (pred_7 ?v6)
             (pred_3 ?v9)
             (pred_9 ?v7)
             (pred_4 ?v9)
             (pred_2 ))



(:action op_4
:parameters (?v2 ?v4 ?v5 ?v13)
:precondition (and (pred_8 ?v2) (pred_8 ?v4) (pred_5 ?v5) (pred_7 ?v13)
          (pred_10 ?v2 ?v4) (pred_1 ?v5 ?v13)
                   (pred_6 ?v4 ?v13) (pred_11 ?v2) 
                   (pred_3 ?v4) (pred_9 ?v5))
:effect (and  (pred_4 ?v4) (not (pred_3 ?v4))))


(:action op_2
:parameters (?v2 ?v8)
:precondition (and (pred_8 ?v2) (pred_8 ?v8)
               (pred_11 ?v2) (pred_10 ?v2 ?v8) (pred_4 ?v8))
:effect (and (pred_11 ?v8) (not (pred_11 ?v2))))

(:action op_3
:parameters (?v2 ?v5)
:precondition (and (pred_8 ?v2) (pred_5 ?v5) 
                  (pred_11 ?v2) (pred_12 ?v5 ?v2) (pred_2 ))
:effect (and (pred_9 ?v5)
   (not (pred_12 ?v5 ?v2)) (not (pred_2 ))))


(:action op_5
:parameters (?v2 ?v10 ?v1)
:precondition (and (pred_8 ?v2) (pred_5 ?v10) (pred_5 ?v1)
                  (pred_11 ?v2) (pred_9 ?v1) (pred_12 ?v10 ?v2))
:effect (and (pred_9 ?v10) (pred_12 ?v1 ?v2)
        (not (pred_9 ?v1)) (not (pred_12 ?v10 ?v2))))

(:action op_1
:parameters (?v2 ?v5)
:precondition (and (pred_8 ?v2) (pred_5 ?v5) 
                  (pred_11 ?v2) (pred_9 ?v5))
:effect (and (pred_2 ) (pred_12 ?v5 ?v2) (not (pred_9 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_12 obj_15 obj_26 obj_08 obj_19 obj_06 obj_04 obj_31 obj_21 obj_20 obj_22 obj_27 obj_09 obj_02 obj_23 obj_10 obj_24 obj_29 obj_25 obj_17 obj_30 obj_05 obj_28 obj_07
    obj_13 obj_14 obj_11
    obj_16 obj_18 obj_01
    )

    (:init
       (pred_2)

       (pred_8 obj_03)
       (pred_8 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_26)
       (pred_8 obj_08)
       (pred_8 obj_19)
       (pred_8 obj_06)
       (pred_8 obj_04)
       (pred_8 obj_31)
       (pred_8 obj_21)
       (pred_8 obj_20)
       (pred_8 obj_22)
       (pred_8 obj_27)
       (pred_8 obj_09)
       (pred_8 obj_02)
       (pred_8 obj_23)
       (pred_8 obj_10)
       (pred_8 obj_24)
       (pred_8 obj_29)
       (pred_8 obj_25)
       (pred_8 obj_17)
       (pred_8 obj_30)
       (pred_8 obj_05)
       (pred_8 obj_28)
       (pred_8 obj_07)
       (pred_7 obj_13)
       (pred_7 obj_14)
       (pred_7 obj_11)
       (pred_5 obj_16)
       (pred_5 obj_18)
       (pred_5 obj_01)

       (pred_10 obj_03 obj_19)
       (pred_10 obj_03 obj_12)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_03)
       (pred_10 obj_15 obj_04)
       (pred_10 obj_15 obj_26)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_26 obj_31)
       (pred_10 obj_26 obj_08)
       (pred_10 obj_26 obj_15)
       (pred_10 obj_08 obj_21)
       (pred_10 obj_08 obj_26)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_19 obj_03)
       (pred_10 obj_06 obj_22)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_06 obj_12)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_04 obj_27)
       (pred_10 obj_04 obj_31)
       (pred_10 obj_04 obj_15)
       (pred_10 obj_04 obj_06)
       (pred_10 obj_31 obj_09)
       (pred_10 obj_31 obj_21)
       (pred_10 obj_31 obj_26)
       (pred_10 obj_31 obj_04)
       (pred_10 obj_21 obj_02)
       (pred_10 obj_21 obj_08)
       (pred_10 obj_21 obj_31)
       (pred_10 obj_20 obj_23)
       (pred_10 obj_20 obj_22)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_22 obj_10)
       (pred_10 obj_22 obj_27)
       (pred_10 obj_22 obj_06)
       (pred_10 obj_22 obj_20)
       (pred_10 obj_27 obj_24)
       (pred_10 obj_27 obj_09)
       (pred_10 obj_27 obj_04)
       (pred_10 obj_27 obj_22)
       (pred_10 obj_09 obj_29)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_09 obj_31)
       (pred_10 obj_09 obj_27)
       (pred_10 obj_02 obj_25)
       (pred_10 obj_02 obj_21)
       (pred_10 obj_02 obj_09)
       (pred_10 obj_23 obj_17)
       (pred_10 obj_23 obj_10)
       (pred_10 obj_23 obj_20)
       (pred_10 obj_10 obj_30)
       (pred_10 obj_10 obj_24)
       (pred_10 obj_10 obj_22)
       (pred_10 obj_10 obj_23)
       (pred_10 obj_24 obj_05)
       (pred_10 obj_24 obj_29)
       (pred_10 obj_24 obj_27)
       (pred_10 obj_24 obj_10)
       (pred_10 obj_29 obj_28)
       (pred_10 obj_29 obj_25)
       (pred_10 obj_29 obj_09)
       (pred_10 obj_29 obj_24)
       (pred_10 obj_25 obj_07)
       (pred_10 obj_25 obj_02)
       (pred_10 obj_25 obj_29)
       (pred_10 obj_17 obj_30)
       (pred_10 obj_17 obj_23)
       (pred_10 obj_30 obj_05)
       (pred_10 obj_30 obj_10)
       (pred_10 obj_30 obj_17)
       (pred_10 obj_05 obj_28)
       (pred_10 obj_05 obj_24)
       (pred_10 obj_05 obj_30)
       (pred_10 obj_28 obj_07)
       (pred_10 obj_28 obj_29)
       (pred_10 obj_28 obj_05)
       (pred_10 obj_07 obj_25)
       (pred_10 obj_07 obj_28)
       (pred_3 obj_31)
       (pred_3 obj_12)
       (pred_3 obj_05)
       (pred_6  obj_31 obj_13)
       (pred_6  obj_12 obj_14)
       (pred_6  obj_05 obj_11)
       (pred_4 obj_03)
       (pred_4 obj_15)
       (pred_4 obj_26)
       (pred_4 obj_08)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_04)
       (pred_4 obj_21)
       (pred_4 obj_20)
       (pred_4 obj_22)
       (pred_4 obj_27)
       (pred_4 obj_09)
       (pred_4 obj_02)
       (pred_4 obj_23)
       (pred_4 obj_10)
       (pred_4 obj_24)
       (pred_4 obj_29)
       (pred_4 obj_25)
       (pred_4 obj_17)
       (pred_4 obj_30)
       (pred_4 obj_28)
       (pred_4 obj_07)

       (pred_1  obj_16 obj_13)
       (pred_1  obj_18 obj_14)
       (pred_1  obj_01 obj_11)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_18 obj_21)
       (pred_12 obj_01 obj_28)
       (pred_11 obj_22)
    )

    (:goal (and
       (pred_12 obj_18 obj_30)
       (pred_12 obj_01 obj_05)
    ))
(:constraints
  (always (not (pred_11 obj_27)))
)
)

; plan
1. (op_2 obj_22 obj_10)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_10)
   goals met: 0 of 2
2. (op_2 obj_10 obj_24)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_24)
   goals met: 0 of 2
3. (op_2 obj_24 obj_29)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_29)
   goals met: 0 of 2
4. (op_2 obj_29 obj_28)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_28)
   goals met: 0 of 2
5. (op_3 obj_28 obj_01)
   deleted: (pred_12 obj_01 obj_28) (pred_2)
   added: (pred_9 obj_01)
   goals met: 0 of 2
6. (op_4 obj_28 obj_05 obj_01 obj_11)
   deleted: (pred_3 obj_05)
   added: (pred_4 obj_05)
   goals met: 0 of 2
7. (op_2 obj_28 obj_07)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_07)
   goals met: 0 of 2
8. (op_2 obj_07 obj_25)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_25)
   goals met: 0 of 2
9. (op_2 obj_25 obj_02)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_02)
   goals met: 0 of 2
10. (op_1 obj_02 obj_01)
   deleted: (pred_9 obj_01)
   added: (pred_2) (pred_12 obj_01 obj_02)
   goals met: 0 of 2
11. (op_2 obj_02 obj_21)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_21)
   goals met: 0 of 2
12. (op_3 obj_21 obj_18)
   deleted: (pred_12 obj_18 obj_21) (pred_2)
   added: (pred_9 obj_18)
   goals met: 0 of 2
13. (op_2 obj_21 obj_02)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_02)
   goals met: 0 of 2
14. (op_2 obj_02 obj_09)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_09)
   goals met: 0 of 2
15. (op_1 obj_09 obj_18)
   deleted: (pred_9 obj_18)
   added: (pred_2) (pred_12 obj_18 obj_09)
   goals met: 0 of 2
16. (op_2 obj_09 obj_02)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_02)
   goals met: 0 of 2
17. (op_3 obj_02 obj_01)
   deleted: (pred_12 obj_01 obj_02) (pred_2)
   added: (pred_9 obj_01)
   goals met: 0 of 2
18. (op_2 obj_02 obj_09)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_09)
   goals met: 0 of 2
19. (op_2 obj_09 obj_29)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_29)
   goals met: 0 of 2
20. (op_2 obj_29 obj_28)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_28)
   goals met: 0 of 2
21. (op_2 obj_28 obj_05)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_05)
   goals met: 0 of 2
22. (op_1 obj_05 obj_01)
   deleted: (pred_9 obj_01)
   added: (pred_2) (pred_12 obj_01 obj_05)
   goals met: 1 of 2
23. (op_2 obj_05 obj_24)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_24)
   goals met: 1 of 2
24. (op_2 obj_24 obj_29)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_29)
   goals met: 1 of 2
25. (op_2 obj_29 obj_09)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_09)
   goals met: 1 of 2
26. (op_3 obj_09 obj_18)
   deleted: (pred_12 obj_18 obj_09) (pred_2)
   added: (pred_9 obj_18)
   goals met: 1 of 2
27. (op_2 obj_09 obj_29)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_29)
   goals met: 1 of 2
28. (op_2 obj_29 obj_24)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_24)
   goals met: 1 of 2
29. (op_2 obj_24 obj_10)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_10)
   goals met: 1 of 2
30. (op_2 obj_10 obj_30)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_30)
   goals met: 1 of 2
31. (op_1 obj_30 obj_18)
   deleted: (pred_9 obj_18)
   added: (pred_2) (pred_12 obj_18 obj_30)
   goals met: 2 of 2
